package xuexi.xiao.liang;

// 变量

// 数据类型 变量名 = 变量初始化值;
// 4类8种数据类型
/*分类
 * A：基本数据类型
 * B：引用数据类型
 * */

public class SuJuLeiXing {
    public static void main(String[] args) {
        // 整形
        // 字节数 1，范围 -128~127
        byte a = 1;
        // 字节数 2，范围 -32768~32767
        short b = 1;
        // 字节数 4，范围 -2147483648~2147483647
        int c = 1;// (整数默认使用)
        // 字节数 8，范围 -2^63~2^63-1
        Long d = 1L;// (加L)
        // 浮点型
        // 字节数 4，范围 -3.403E38~3.403E38
        float e = 1.1F;// (加F)
        // 字节数 8，范围 -1.798E308~1.798E308
        double f = 1.1;// (小数默认使用)
        // 字符型
        // 字节数 2，范围 一个字符
        char j = '我';
        // 布尔型
        // 字节数 1，范围 两个值
        boolean h = true;// 真
        boolean r = false;// 假

//======================================================================================================================

        // 一行多定义(不符合规范)
        int aa, bb;
        aa = 111;
        bb = 222;
        System.out.println(aa);
        System.out.println(bb);

//======================================================================================================================

        // 运算
        // 隐式转换
        // byte,short,char---int----long----float----double
        // boolean不参与转换
        // 不同数据类型相加用大的数据类型
        byte aaa = 10;
        int bbb = 20;
        int ccc = (aaa + bbb);
        System.out.println(ccc);

        // 强制转换（不同数据类型相加）
        // 目标类型 变量名 = (目标类型) (被转换的数据);


    }
}
